In [1]:
pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-8.1.0-py2.py3-none-any.whl (581 kB)
     |████████████████████████████████| 581 kB 773 kB/s eta 0:00:01
Collecting protobuf<=4.21.12,>=4.21.1
  Downloading protobuf-4.21.12-cp37-abi3-macosx_10_9_universal2.whl (486 kB)
     |████████████████████████████████| 486 kB 7.2 MB/s eta 0:00:01
Installing collected packages: protobuf, mysql-connector-python
  Attempting uninstall: protobuf
    Found existing installation: protobuf 3.19.1
    Uninstalling protobuf-3.19.1:
      Successfully uninstalled protobuf-3.19.1
ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
tensorflow 2.11.0 requires protobuf<3.20,>=3.9.2, but you have protobuf 4.21.12 which is incompatible.
tensorboard 2.11.2 requires protobuf<4,>=3.9.2, but you have protobuf 4.21.12 which is incompatible.
Successfully installed mysql-connector-python-8.1.0 protobuf-4.21.12
Note: you may need to restart the kernel to use updated packages.

In [2]:
import mysql.connector

In [22]:
conn_string = mysql.connector.connect(
	host='localhost',
	user='root',
	password=''
)
print("Connection is sucessful")

Connection is sucessful

In [23]:
current_cursor= conn_string.cursor()
current_cursor.execute("SHOW DATABASES;")

for x in current_cursor:
    print(x)
#conn_string.close()

('CSV_DB 15',)
('CSV_DB 16',)
('MyStore',)
('Sales',)
('data_storage',)
('foodshop',)
('information_schema',)
('library',)
('movie_rental',)
('mysql',)
('performance_schema',)
('phpmyadmin',)
('storage',)
('supply',)
('tech_academy',)
('test',)
('try_root',)

In [27]:
current_cursor.execute('USE movie_rental;')

In [28]:
current_cursor.execute("SHOW TABLES;")
for x in current_cursor:
    print(x)

('clients',)
('genres',)
('movies',)
('rents',)

In [32]:
current_cursor.execute('select * from clients;')
for x in current_cursor:
    print(x)

(1, 'Mark', 'Guiliana', datetime.date(1989, 9, 12), '-1321')
(2, 'Benny', 'Greb', datetime.date(1985, 4, 4), '545-862-745')
(3, 'Mark', 'Twain', datetime.date(1990, 7, 22), '541-965-785')
(4, 'Anna', 'Ivanovna', datetime.date(1994, 9, 12), '654-785-022')
(5, 'Kate', 'Bengio', datetime.date(2000, 12, 1), '854-889-886')
(6, 'Siraj', 'Rawal', datetime.date(1991, 4, 18), '854-889886')
(7, 'James', 'Arthur', datetime.date(1989, 6, 24), '654-852-962')

In [33]:
import pandas as pd

In [40]:
connection = mysql.connector.connect(
	host='localhost',
	user='root',
	password='',
    db='movie_rental'
)
print("Connection is sucessful")

Connection is sucessful

In [41]:
clients_data=pd.read_sql_query("Select * from clients;", connection)

In [42]:
clients_data

   clientsID firstName  lastname         dob        phone
0          1      Mark  Guiliana  1989-09-12        -1321
1          2     Benny      Greb  1985-04-04  545-862-745
2          3      Mark     Twain  1990-07-22  541-965-785
3          4      Anna  Ivanovna  1994-09-12  654-785-022
4          5      Kate    Bengio  2000-12-01  854-889-886
5          6     Siraj     Rawal  1991-04-18   854-889886
6          7     James    Arthur  1989-06-24  654-852-962

UsageError: Cell magic `%%` not found.